<a href="https://colab.research.google.com/github/urness/CS167Code/blob/main/Day03_exercise_solutions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

An example of a markdown cell<br>
Author: <b>Professor Urness</b><br>
Date: February 1, 2022
# Python and Pandas Exercises

Before you begin, make sure you download the data from Blackboard and put it in your Google Drive where you know how to find it (preferably in a datasets folder).

## Part 1: Selecting columns in dataframes

In [ ]:
#selecting columns in dataframes
import pandas
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
titanic = pandas.read_csv('/content/drive/MyDrive/CS167Spring22/datasets/titanic.csv')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
# what is the data type of titanic?
type(titanic)

pandas.core.frame.DataFrame

In [ ]:
# what are the features (column titles) of the titanic dataset?
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [ ]:
# display only the 'embark_town' column of the titanic data
titanic.embark_town

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object

In [ ]:
# what is the data type of the result of the previous cell? 
type(titanic.embark_town)

pandas.core.series.Series

In [ ]:
# what is the "shape" of the data frame?
titanic.shape

(891, 15)

In [ ]:
# make a subset (call the variable 'subset') of the data that consists of the last 20 rows of the data;
# verify that your subset has 20 rows
subset = titanic[871:]
subset.shape

(20, 15)

In [ ]:
# make a subset that consists of the last 20 rows of the data and the columns: survived, pclass, sex, and age	 
subset2 = subset[["survived", "pclass", "sex", "age"]]
subset2.shape

(20, 4)

## Part 2: Selecting rows: loc vs iloc

In [ ]:
# use loc to print out the data for passenger 890 on the titanic dataframe
# use iloc to print out the data for passenger 890 on the subest dataframe
print(titanic.loc[890])
print(titanic.iloc[890])

survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object
survived                0
pclass                  3
sex                  male
age                    32
sibsp                   0
parch                   0
fare                 7.75
embarked                Q
class               Third
who                   man
adult_male           True
deck                  NaN
embark_town    Queenstown
alive                  no
alone                True
Name: 890, dtype: object

In [ ]:
# use a markdown cell; describe the difference between loc and iloc

loc identifies a row of the data. The value in the [] is a "label" of that particular row; iloc refers to the index of the row. A label can be any value, but the iloc is going to be the true index of the row.

## Part 3: Subsetting using series

In [ ]:
# create a subset of the data (call the variable 'queenstown_subset') that consists only of passengers with
# a 'embark_town' that is "Queenstown"
# hint: if you get a warning, you may need to explicitly note that you are making a copy of the original data by using 
# the .copy() function
queenstown_subset = titanic[titanic['embark_town'] == "Queenstown"]
queenstown_subset.head()

    survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5          0       3    male   NaN  ...   NaN   Queenstown     no   True
16         0       3    male   2.0  ...   NaN   Queenstown     no  False
22         1       3  female  15.0  ...   NaN   Queenstown    yes   True
28         1       3  female   NaN  ...   NaN   Queenstown    yes   True
32         1       3  female   NaN  ...   NaN   Queenstown    yes   True

[5 rows x 15 columns]

In [ ]:
# how many passengers are in queenstown_subset?
len(queenstown_subset)

77

## Part 4: Some Handy Functions

In [ ]:
# what is the average fare for all of those in the queenstown_subset?
queenstown_subset['fare'].mean()

13.276029870129872

In [ ]:
# what is the average age for all of those in the queenstown_subset?
# do all of the passengers have an age recorded? What is recorded if there is no age?
print(queenstown_subset['age'].mean())
queenstown_subset

28.089285714285715

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
5           0       3    male   NaN  ...   NaN   Queenstown     no   True
16          0       3    male   2.0  ...   NaN   Queenstown     no  False
22          1       3  female  15.0  ...   NaN   Queenstown    yes   True
28          1       3  female   NaN  ...   NaN   Queenstown    yes   True
32          1       3  female   NaN  ...   NaN   Queenstown    yes   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
790         0       3    male   NaN  ...   NaN   Queenstown     no   True
825         0       3    male   NaN  ...   NaN   Queenstown     no   True
828         1       3    male   NaN  ...   NaN   Queenstown    yes   True
885         0       3  female  39.0  ...   NaN   Queenstown     no  False
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[77 rows x 15 columns]

No. If the values do not contain a value, NaN is listed.

In [ ]:
# What does unique(), mean(), isnull(), and fillna() do? Use a markdown cell to write your answers
# Use the Pandas documentation (https://pandas.pydata.org/pandas-docs/stable/reference/index.html)


*   `unique()` Return unique values of Series object.
*   `isnull()` Return a boolean same-sized object indicating if the values are NA
*   `fillna()` Fill NA/NaN values using the specified method.

In [ ]:
# give examples of your use of unique(), mean(), median(), isnull()
queenstown_subset['class'].unique()

array(['Third', 'First', 'Second'], dtype=object)

In [ ]:
queenstown_subset['age'].mean()

28.089285714285715

In [ ]:
queenstown_subset['age'].median()

27.0

In [ ]:
queenstown_subset['age'].isnull()

5       True
16     False
22     False
28      True
32      True
       ...
790     True
825     True
828     True
885    False
890    False
Name: age, Length: 77, dtype: bool

In [ ]:
# load in the iris data
# what is the median sepal width of just the Setosas?
#import the data:
#make sure the path on the line below corresponds to the path where you put your dataset.
iris_data = pandas.read_csv('/content/drive/MyDrive/CS167Spring22/datasets/irisData.csv')
iris_data

     sepal length  sepal width  petal length  petal width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [ ]:
iris_data["sepal width"].median()

3.0

In [ ]:
# for those iris that are classified as versicolor and have 
# a petal-length > 4, what is the average sepal width?
iris_data[(iris_data['species'] == "Iris-versicolor") & (iris_data['petal length'] > 4.0) ] ["sepal width"].mean()

2.902941176470588